# Ejercicios

### 1 Ejercicio

Dado el siguiente DataFrame:

In [6]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'int_col' : [1,2,6,8,-1],               
                   'float_col' : [0.1, 0.2,0.2,10.1,None], 
                   'str_col' : ['a','b',None,'c','a']})    
                                                        
destino = df.reindex([4,2,3,1,0, 5, 6], fill_value = 99)
destino

   float_col  int_col str_col
4        NaN       -1       a
2        0.2        6    None
3       10.1        8       c
1        0.2        2       b
0        0.1        1       a
5       99.0       99      99
6       99.0       99      99

1. Observa lo que hace la función __reindex__ con la opción `fill_value`
2. Selecciona las filas del DataFrame 'destino' que cumplan que el dato en la columna 'float_col' sea > que 10.
2. ¿Qué ocurre con los valores NaN?

In [7]:
# Sol:

### 2 Ejercicio

La hoja de cálculo [resumen_contable.xlsx](./datos/resumen_contable.xlsx) recoge los gastos e ingresos de distintas delegaciones de una empresa.
El siguiente código crea los dataFrames asociados a cada una de las delegaciones.

In [9]:
from pandas import ExcelFile
resumen = pd.ExcelFile('./datos/resumen_contable.xlsx')
Valencia = resumen.parse(0,  skiprows=1 )     # datos de la primera hoja
Sevilla = resumen.parse(1,  skiprows=1 )   
Galicia = resumen.parse(2,  skiprows=1 )

Se pretende unificar todos los datos de forma que tengamos un resumen de gastos e ingresos anual de toda la empresa. Utiiza la función __add__.

__Posible Solución (esta no es una buena solución aunque el resultado sea correcto):__

In [4]:
m = pd.merge(Sevilla, Valencia, on = 'Year', how= 'outer')
m

   Year  Gastos_x  Ingresos_x  Gastos_y  Ingresos_y
0  2000      1000        5000      4000        8000
1  2002      5000        5000       NaN         NaN
2  2005      2500        3000      2154        3000
3  2006      6000        7000      5201        1000
4  2008      2500        1500       NaN         NaN
5  2001       NaN         NaN      3000        5000
6  2007       NaN         NaN      2000        1000
7  2010       NaN         NaN      9000        2000

In [5]:
m['nueva_g'] = m.loc[:, 'Gastos_x'] + m.loc[:, 'Gastos_y']
m

   Year  Gastos_x  Ingresos_x  Gastos_y  Ingresos_y  nueva_g
0  2000      1000        5000      4000        8000     5000
1  2002      5000        5000       NaN         NaN      NaN
2  2005      2500        3000      2154        3000     4654
3  2006      6000        7000      5201        1000    11201
4  2008      2500        1500       NaN         NaN      NaN
5  2001       NaN         NaN      3000        5000      NaN
6  2007       NaN         NaN      2000        1000      NaN
7  2010       NaN         NaN      9000        2000      NaN

In [ ]:
# Sol:
# teniendo en cuenta que pandas realiza alineamiento de datos:
from pandas import ExcelFile
resumen = pd.ExcelFile('./datos/resumen_contable.xlsx')
....

### 3 Ejercicio

El fichero [quakes.csv](./datos/quakes.csv) recoge los datos de observaciones de movimientos sísmicos de magnitud superior a 4 en la escala de Richter  en un sector de la ciudad de Fiji desde 1964. 

1. Mostrar todos los datos con un único decimal. Para ello aplica la función __applymap__ .

In [7]:
tabla_sismicos = pd.read_csv('./datos/quakes.csv', 
     names = ['Latitud', 'Longitud', 'Profundidad','Magnitud', 'Estaciones'] )
tabla_sismicos.head()

   Latitud Longitud  Profundidad  Magnitud  Estaciones
1   -20.42   181.62          562       4.8          41
2   -20.62   181.03          650       4.2          15
3   -26.00        -           42       5.4          43
4   -17.97   181.66          626       4.1          19
5   -20.42   181.96          649       4.0          11

In [8]:
# Sol:

### 4 Ejercicio

El fichero [quakes.csv](./datos/quakes.csv) recoge los datos de observaciones de movimientos sísmicos de magnitud superior a 4 en la escala de Richter  en un sector de la ciudad de Fiji desde 1964. 

1. Crea un DataFrame con los datos del fichero como has hecho en PR3. En la creación del DataFrame utiliza la opción __na_values__ para  indicar que los valores '-' en la columna __Longitud__ se carguen como NaN.
2. Sustituye todos los valores NaN por 0.

In [9]:
# Sol: